
Задание 1.
Напишите регулярное выражение для проверки является ли строка IPv4 адресом.

Для тестов можно использовать файл со следующим содержимым, фильтруя вывод с помощью команды grep -E:

192.168.0.1
127.0.0.1
84.345.23.11
88.3A.56.76
224.12.76
999.999.999.999
355.255.255.257
0.0.0.0
Пришлите получившееся выражение в качестве ответа.

Ответ: ^((25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$

Задание 2.
В Вашей конфигурации Nginx скопилось много неиспользуемых сегментов и становится сложно его читать.

Используя sed удалите все пустые строки и комментарии в конфигурации Nginx.

Попробуйте сделать это одним запуском.

Файл расположен по ссылке

Пришлите получившуюся команду в качестве ответа

Ответ: ```bash
sed -e '/^\s*#/d' -e '/^\s*$/d' nginx.conf > nginx_clean.conf
```

Задание 3.
Используя awk и ps aux соберите информацию о:

количестве процессов для каждого пользователя;
процессе с самым большим PID;
(дополнительное задание со звездочкой*) суммарном использовании памяти различными пользователями.
Пришлите скриншоты со скриптами и демонстрацией их работы
